Revit 2027 API
FabricationConfiguration.GetAncillaries Method
 Gets fabrication ancillaries of the specified type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<int> GetAncillaries(
	FabricationAncillaryType type,
	bool includeKits,
	bool filterKits
)
Public Function GetAncillaries (
	type As FabricationAncillaryType,
	includeKits As Boolean,
	filterKits As Boolean
) As IList(Of Integer)
public:
IList<int>^ GetAncillaries(
	FabricationAncillaryType type,
	bool includeKits,
	bool filterKits
)
member GetAncillaries :
        type : FabricationAncillaryType *
        includeKits : bool *
        filterKits : bool -> IList<int>
Parameters
type FabricationAncillaryType
 The type of ancillaries to get.
includeKits Boolean
 Whether or not to include ancillary kits as well.
filterKits Boolean
 Whether kits should be filtered to only those that contain the specified ancillary type.
Return Value
IList<Int32>
 An array of ancillary identifiers.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace